package com.krasnikov.hospitalmanagmentsystem.initializer;

import jakarta.annotation.PostConstruct;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.jdbc.core.JdbcTemplate;
import org.springframework.stereotype.Component;

@Component
public class DataInitializer {


    private JdbcTemplate jdbcTemplate;

    @Autowired
    public DataInitializer(JdbcTemplate jdbcTemplate) {
        this.jdbcTemplate = jdbcTemplate;
    }

    @PostConstruct
    public void initData() {
        jdbcTemplate.execute("INSERT INTO patient (id, full_name, age, gender, disease, admission_date, discharge_date) " +
                "VALUES (1, 'Иванов Иван Иванович', 30, 'Мужской', 'Грипп', '2024-02-20', '2024-02-28')," +
                "(2, 'Петрова Мария Сергеевна', 25, 'Женский', 'Ангина', '2024-02-25', '2024-03-05')," +
                "(3, 'Иванова Анна Петровна', 40, 'Женский', 'ОРЗ', '2024-02-23', '2024-03-02')," +
                "(4, 'Сидоров Павел Николаевич', 45, 'Мужской', 'Гастрит', '2024-02-26', '2024-03-07')," +
                "(5, 'Петров Игорь Сергеевич', 35, 'Мужской', 'Простуда', '2024-02-21', '2024-02-29')," +
                "(6, 'Смирнова Елена Ивановна', 28, 'Женский', 'Ангина', '2024-02-24', '2024-03-03')," +
                "(7, 'Козлов Александр Владимирович', 50, 'Мужской', 'Грипп', '2024-02-22', '2024-03-01')," +
                "(8, 'Федорова Анна Александровна', 55, 'Женский', 'ОРЗ', '2024-02-27', '2024-03-06')," +
                "(9, 'Никитин Дмитрий Викторович', 32, 'Мужской', 'Простуда', '2024-02-28', '2024-03-08')," +
                "(10, 'Белова Екатерина Дмитриевна', 27, 'Женский', 'Гастрит', '2024-02-29', '2024-03-09')," +
                "(11, 'Морозов Павел Алексеевич', 38, 'Мужской', 'Ангина', '2024-03-01', '2024-03-10')," +
                "(12, 'Иванова Мария Петровна', 42, 'Женский', 'Грипп', '2024-03-02', '2024-03-11')," +
                "(13, 'Смирнов Алексей Андреевич', 48, 'Мужской', 'ОРЗ', '2024-03-03', '2024-03-12')," +
                "(14, 'Петров Дмитрий Игоревич', 31, 'Мужской', 'Ангина', '2024-03-04', '2024-03-13')," +
                "(15, 'Сидорова Елена Сергеевна', 37, 'Женский', 'Гастрит', '2024-03-05', '2024-03-14')," +
                "(16, 'Козлова Анна Александровна', 43, 'Женский', 'Простуда', '2024-03-06', '2024-03-15')," +
                "(17, 'Федоров Владимир Викторович', 47, 'Мужской', 'Грипп', '2024-03-07', '2024-03-16')," +
                "(18, 'Никитина Анастасия Дмитриевна', 33, 'Женский', 'ОРЗ', '2024-03-08', '2024-03-17')," +
                "(19, 'Белов Игорь Алексеевич', 29, 'Мужской', 'Гастрит', '2024-03-09', '2024-03-18')," +
                "(20, 'Морозова Марина Владимировна', 36, 'Женский', 'Простуда', '2024-03-10', '2024-03-19');");
    }
}
